public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета,
        int sale = 6999;
        // другую для хранения количества
        // рублей для одной бонусной мили
        int miles = 20;
        // Рассчитываете количество бонусных миль, используя значения заведённых переменных.
        System.out.println("Бонцсных миль " + sale / miles);
        // Ответ сохраняете в новую переменную и выводите на экран
    }
}
